#### Terraform Format and Style 🖌`success`
<details><summary>Formatting Output</summary>

```


```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>
            
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_app.api will be created
  + resource "azurerm_container_app" "api" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = (known after apply)
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = (known after apply)
      + revision_mode                 = "Single"
      + tags                          = {
          + "environment" = "sbx"
          + "managedby"   = "Terraform"
          + "pipeline"    = "Github Actions"
          + "service"     = "Api"
        }
      + workload_profile_name         = "Dedicated"

      + ingress {
          + allow_insecure_connections = false
          + exposed_port               = 5000
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 5000
          + transport                  = "tcp"

          + custom_domain (known after apply)

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 1
          + min_replicas    = 1
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 1
              + ephemeral_storage = (known after apply)
              + image             = "index.docker.io/heathen1878/api:sbx"
              + memory            = "2Gi"
              + name              = "api"

              + env {
                  + name  = "REDIS_HOST"
                  + value = (known after apply)
                }
              + env {
                  + name  = "REDIS_PORT"
                  + value = "6379"
                }
              + env {
                  + name  = "PGUSER"
                  + value = "postgres"
                }
              + env {
                  + name  = "PGHOST"
                  + value = (known after apply)
                }
              + env {
                  + name  = "PGDATABASE"
                  + value = "fibonacci"
                }
              + env {
                  + name  = "PGPORT"
                  + value = "5432"
                }
              + env {
                  + name  = "PGPASSWORD"
                  + value = "supersecretpassword"
                }
            }
        }
    }

  # azurerm_container_app.client will be created
  + resource "azurerm_container_app" "client" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = (known after apply)
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = (known after apply)
      + revision_mode                 = "Single"
      + tags                          = {
          + "environment" = "sbx"
          + "managedby"   = "Terraform"
          + "pipeline"    = "Github Actions"
          + "service"     = "Client"
        }
      + workload_profile_name         = "Dedicated"

      + ingress {
          + allow_insecure_connections = false
          + exposed_port               = 3000
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 3000
          + transport                  = "tcp"

          + custom_domain (known after apply)

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 1
          + min_replicas    = 1
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 1
              + ephemeral_storage = (known after apply)
              + image             = "index.docker.io/heathen1878/client:sbx"
              + memory            = "2Gi"
              + name              = "client"
            }
        }
    }

  # azurerm_container_app.nginx will be created
  + resource "azurerm_container_app" "nginx" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = (known after apply)
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = (known after apply)
      + revision_mode                 = "Single"
      + tags                          = {
          + "environment" = "sbx"
          + "managedby"   = "Terraform"
          + "pipeline"    = "Github Actions"
          + "service"     = "NGinx"
        }
      + workload_profile_name         = "Dedicated"

      + ingress {
          + allow_insecure_connections = true
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 80
          + transport                  = "auto"

          + custom_domain (known after apply)

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 0
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 1
              + ephemeral_storage = (known after apply)
              + image             = "index.docker.io/heathen1878/nginx:sbx"
              + memory            = "2Gi"
              + name              = "nginx"
            }
        }
    }

  # azurerm_container_app.redis will be created
  + resource "azurerm_container_app" "redis" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = (known after apply)
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = (known after apply)
      + revision_mode                 = "Single"
      + workload_profile_name         = "Dedicated"

      + ingress {
          + allow_insecure_connections = false
          + exposed_port               = 6379
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 6379
          + transport                  = "tcp"

          + custom_domain (known after apply)

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 1
          + min_replicas    = 1
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 1
              + ephemeral_storage = (known after apply)
              + image             = "redis:latest"
              + memory            = "2Gi"
              + name              = "redis"
            }
        }
    }

  # azurerm_container_app.worker will be created
  + resource "azurerm_container_app" "worker" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = (known after apply)
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = (known after apply)
      + revision_mode                 = "Single"
      + tags                          = {
          + "environment" = "sbx"
          + "managedby"   = "Terraform"
          + "pipeline"    = "Github Actions"
          + "service"     = "Worker"
        }
      + workload_profile_name         = "Dedicated"

      + template {
          + max_replicas    = 1
          + min_replicas    = 1
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 1
              + ephemeral_storage = (known after apply)
              + image             = "index.docker.io/heathen1878/worker:sbx"
              + memory            = "2Gi"
              + name              = "worker"

              + env {
                  + name  = "REDIS_HOST"
                  + value = (known after apply)
                }
              + env {
                  + name  = "REDIS_PORT"
                  + value = "6379"
                }
            }
        }
    }

  # azurerm_container_app_environment.this will be created
  + resource "azurerm_container_app_environment" "this" {
      + custom_domain_verification_id      = (known after apply)
      + default_domain                     = (known after apply)
      + docker_bridge_cidr                 = (known after apply)
      + id                                 = (known after apply)
      + infrastructure_resource_group_name = (known after apply)
      + infrastructure_subnet_id           = (known after apply)
      + internal_load_balancer_enabled     = false
      + location                           = "uksouth"
      + mutual_tls_enabled                 = false
      + name                               = (known after apply)
      + platform_reserved_cidr             = (known after apply)
      + platform_reserved_dns_ip_address   = (known after apply)
      + resource_group_name                = (known after apply)
      + static_ip_address                  = (known after apply)
      + tags                               = {
          + "environment" = "sbx"
          + "managedby"   = "Terraform"
          + "pipeline"    = "Github Actions"
          + "service"     = "Container App Environment"
        }
      + zone_redundancy_enabled            = false

      + workload_profile {
          + maximum_count         = 3
          + minimum_count         = 1
          + name                  = "Dedicated"
          + workload_profile_type = "D4"
        }
    }

  # azurerm_postgresql_flexible_server.this will be created
  + resource "azurerm_postgresql_flexible_server" "this" {
      + administrator_login           = "postgres"
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = false
      + backup_retention_days         = (known after apply)
      + delegated_subnet_id           = (known after apply)
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = (known after apply)
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = false
      + resource_group_name           = (known after apply)
      + sku_name                      = "B_Standard_B2s"
      + storage_mb                    = 32768
      + storage_tier                  = "P4"
      + version                       = "12"

      + authentication (known after apply)
    }

  # azurerm_private_dns_zone.psql will be created
  + resource "azurerm_private_dns_zone" "psql" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.postgres.database.azure.com"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = (known after apply)

      + soa_record (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.psql will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "psql" {
      + id                    = (known after apply)
      + name                  = "psql"
      + private_dns_zone_name = "privatelink.postgres.database.azure.com"
      + registration_enabled  = false
      + resource_group_name   = (known after apply)
      + virtual_network_id    = (known after apply)
    }

  # azurerm_resource_group.this will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = (known after apply)
      + tags     = {
          + "environment" = "sbx"
          + "managedby"   = "Terraform"
          + "pipeline"    = "Github Actions"
          + "service"     = "Container App Environment"
        }
    }

  # azurerm_subnet.cae will be created
  + resource "azurerm_subnet" "cae" {
      + address_prefixes                               = [
          + "192.168.0.0/21",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "cae"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = (known after apply)
      + virtual_network_name                           = (known after apply)

      + delegation {
          + name = "cae"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.App/environments"
            }
        }
    }

  # azurerm_subnet.pe will be created
  + resource "azurerm_subnet" "pe" {
      + address_prefixes                               = [
          + "192.168.8.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "pe"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = (known after apply)
      + virtual_network_name                           = (known after apply)
    }

  # azurerm_subnet.psql will be created
  + resource "azurerm_subnet" "psql" {
      + address_prefixes                               = [
          + "192.168.9.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "psql"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = (known after apply)
      + service_endpoints                              = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = (known after apply)

      + delegation {
          + name = "psql"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

  # azurerm_subnet.redis will be created
  + resource "azurerm_subnet" "redis" {
      + address_prefixes                               = [
          + "192.168.10.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "redis"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = (known after apply)
      + virtual_network_name                           = (known after apply)
    }

  # azurerm_virtual_network.this will be created
  + resource "azurerm_virtual_network" "this" {
      + address_space       = [
          + "192.168.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = (known after apply)
      + resource_group_name = (known after apply)
      + subnet              = (known after apply)
      + tags                = {
          + "environment" = "sbx"
          + "managedby"   = "Terraform"
          + "pipeline"    = "Github Actions"
          + "service"     = "Networking"
        }
    }

  # random_id.this will be created
  + resource "random_id" "this" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "key" = "9b882470-ca03-4e89-8f7a-fe80f0755344"
        }
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + dummy = "Initialisation"

```

</details>

Pusher: @heathen1878
Action: pull_request
Workflow: Validate Fibonacci Infrastructure